RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_1xxxx_FWLib/library/Device/Holtek/HT32F1xxxx/Include/ht32f1xxxx_01.h
/**
 * @brief Secure digital input/output
 */
typedef struct
{
                                 /* SDIO: 0x400A0000                                                        */
  __IO uint32_t BLKSIZE;         /*!< 0x000         Block Size Register                                     */
  __IO uint32_t BLKCNT;          /*!< 0x004         Block Count Register                                    */
  __IO uint32_t ARG;             /*!< 0x008         Argument Register                                       */
  __IO uint32_t TMR;             /*!< 0x00C         Transfer Mode Register                                  */
  __IO uint32_t CMD;             /*!< 0x010         Command Register Register                               */
  __IO uint32_t RESP0;           /*!< 0x014         Response Register 0                                     */
  __IO uint32_t RESP1;           /*!< 0x018         Response Register 1                                     */
  __IO uint32_t RESP2;           /*!< 0x01C         Response Register 2                                     */
  __IO uint32_t RESP3;           /*!< 0x020         Response Register 3                                     */
  __IO uint32_t DR;              /*!< 0x024         Data Register                                           */
  __IO uint32_t PSR;             /*!< 0x028         Present Status Register                                 */
  __IO uint32_t CR;              /*!< 0x02C         Control Register                                        */
       uint32_t RESERVED0[2];    /*!< 0x030 - 0x034 Reserved                                                */
  __IO uint32_t CLKCR;           /*!< 0x038         Clock Control Register                                  */
  __IO uint32_t TMOCR;           /*!< 0x03C         Timeout Control Register                                */
  __IO uint32_t SWRST;           /*!< 0x040         Software Reset Register                                 */
  __IO uint32_t SR;              /*!< 0x044         Status Register                                         */
  __IO uint32_t SER;             /*!< 0x048         Status Enable Register                                  */
  __IO uint32_t IER;             /*!< 0x04C         Interrupt Enable Register                               */
} HT_SDIO_TypeDef;


/**
 * @brief CMOS Sensor Interface
 */
typedef struct
{
                                 /* CSIF: 0x400CC000                                                        */
  __IO uint32_t ENR;             /*!< 0x000    Enable Register                                              */
  __IO uint32_t CR;              /*!< 0x004    Control Register                                             */
  __IO uint32_t IMGWH;           /*!< 0x008    Image Width/Height Register                                  */
  __IO uint32_t WCR0;            /*!< 0x00C    Window Capture 0 Register                                    */
  __IO uint32_t WCR1;            /*!< 0x010    Window Capture 1 Register                                    */
  __IO uint32_t SMP;             /*!< 0x014    Row & Column Sub-Sample Register                             */
  __IO uint32_t SMPCOL;          /*!< 0x018    Column Sub-Sample Register                                   */
  __IO uint32_t SMPROW;          /*!< 0x01C    Row Sub-Sample Register                                      */
  __IO uint32_t FIFO0;           /*!< 0x020    FIFO Register 0                                              */
  __IO uint32_t FIFO1;           /*!< 0x024    FIFO Register 1                                              */
  __IO uint32_t FIFO2;           /*!< 0x028    FIFO Register 2                                              */
  __IO uint32_t FIFO3;           /*!< 0x02C    FIFO Register 3                                              */
  __IO uint32_t FIFO4;           /*!< 0x030    FIFO Register 4                                              */
  __IO uint32_t FIFO5;           /*!< 0x034    FIFO Register 5                                              */
  __IO uint32_t FIFO6;           /*!< 0x038    FIFO Register 6                                              */
  __IO uint32_t FIFO7;           /*!< 0x03C    FIFO Register 7                                              */
  __IO uint32_t IER;             /*!< 0x040    Interrupt Enable Register                                    */
  __IO uint32_t SR;              /*!< 0x044    Status Register                                              */
} HT_CSIF_TypeDef;


/**
 * @brief Advanced Encryption Standard
 */
typedef struct
{
                                 /* AES: 0x400C8000                                                         */
  __IO uint32_t CR;              /*!< 0x000         Control Register                                        */
  __IO uint32_t SR;              /*!< 0x004         Status Register                                         */
  __IO uint32_t PDMAR;           /*!< 0x008         PDMA Register                                           */
  __IO uint32_t ISR;             /*!< 0x00C         Interrupt Status Register                               */
  __IO uint32_t IER;             /*!< 0x010         Interrupt Enable Register                               */
  __IO uint32_t DINR;            /*!< 0x014         Data Input Register                                     */
  __IO uint32_t DOUTR;           /*!< 0x018         Data Output Register                                    */
  __IO uint32_t KEYR[8];         /*!< 0x01C - 0x038 Key Register 0~7                                        */
  __IO uint32_t IVR[4];          /*!< 0x03C - 0x048 Initial Vector Register 0~3                             */
} HT_AES_TypeDef;


/**
  * @}
  */


/** @addtogroup Peripheral_Memory_Map
  * @{
  */

#define HT_SRAM_BASE             (0x20000000UL)
#define HT_SRAM_BB_BASE          (0x22000000UL)

#define HT_PERIPH_BASE           (0x40000000UL)
#define HT_PERIPH_BB_BASE        (0x42000000UL)

#define HT_APB0PERIPH_BASE       (HT_PERIPH_BASE)                 /* 0x40000000                             */
#define HT_APB1PERIPH_BASE       (HT_PERIPH_BASE + 0x40000)       /* 0x40040000                             */
#define HT_AHBPERIPH_BASE        (HT_PERIPH_BASE + 0x80000)       /* 0x40080000                             */

/* APB0                                                                                                     */
#define HT_USART0_BASE           (HT_APB0PERIPH_BASE + 0x0000)    /* 0x40000000                             */
#define HT_UART0_BASE            (HT_APB0PERIPH_BASE + 0x1000)    /* 0x40001000                             */
#define HT_SPI0_BASE             (HT_APB0PERIPH_BASE + 0x4000)    /* 0x40004000                             */
#define HT_ADC0_BASE             (HT_APB0PERIPH_BASE + 0x10000)   /* 0x40010000                             */
#define HT_CMP_OP0_BASE          (HT_APB0PERIPH_BASE + 0x18000)   /* 0x40018000                             */
#define HT_CMP_OP1_BASE          (HT_APB0PERIPH_BASE + 0x18100)   /* 0x40018100                             */
#define HT_AFIO_BASE             (HT_APB0PERIPH_BASE + 0x22000)   /* 0x40022000                             */
#define HT_EXTI_BASE             (HT_APB0PERIPH_BASE + 0x24000)   /* 0x40024000                             */
#define HT_I2S_BASE              (HT_APB0PERIPH_BASE + 0x26000)   /* 0x40026000                             */
#define HT_MCTM0_BASE            (HT_APB0PERIPH_BASE + 0x2C000)   /* 0x4002C000                             */
#define HT_MCTM1_BASE            (HT_APB0PERIPH_BASE + 0x2D000)   /* 0x4002D000                             */
#define HT_PWM0_BASE             (HT_APB0PERIPH_BASE + 0x31000)   /* 0x40031000                             */
#define HT_SCTM0_BASE            (HT_APB0PERIPH_BASE + 0x34000)   /* 0x40034000                             */
#define HT_SCI1_BASE             (HT_APB0PERIPH_BASE + 0x3A000)   /* 0x4003A000                             */

/* APB1                                                                                                     */
#define HT_USART1_BASE           (HT_APB1PERIPH_BASE + 0x0000)    /* 0x40040000                             */
#define HT_UART1_BASE            (HT_APB1PERIPH_BASE + 0x1000)    /* 0x40041000                             */
#define HT_SCI0_BASE             (HT_APB1PERIPH_BASE + 0x3000)    /* 0x40043000                             */
#define HT_SPI1_BASE             (HT_APB1PERIPH_BASE + 0x4000)    /* 0x40044000                             */
#define HT_I2C0_BASE             (HT_APB1PERIPH_BASE + 0x8000)    /* 0x40048000                             */
#define HT_I2C1_BASE             (HT_APB1PERIPH_BASE + 0x9000)    /* 0x40049000                             */
#define HT_CMP0_BASE             (HT_APB1PERIPH_BASE + 0x18000)   /* 0x40058000                             */
#define HT_CMP1_BASE             (HT_APB1PERIPH_BASE + 0x18100)   /* 0x40058100                             */
#define HT_WDT_BASE              (HT_APB1PERIPH_BASE + 0x28000)   /* 0x40068000                             */
#define HT_RTC_BASE              (HT_APB1PERIPH_BASE + 0x2A000)   /* 0x4006A000                             */
#define HT_PWRCU_BASE            (HT_APB1PERIPH_BASE + 0x2A100)   /* 0x4006A100                             */
#define HT_GPTM0_BASE            (HT_APB1PERIPH_BASE + 0x2E000)   /* 0x4006E000                             */
#define HT_GPTM1_BASE            (HT_APB1PERIPH_BASE + 0x2F000)   /* 0x4006F000                             */
#define HT_SCTM1_BASE            (HT_APB1PERIPH_BASE + 0x34000)   /* 0x40074000                             */
#define HT_BFTM0_BASE            (HT_APB1PERIPH_BASE + 0x36000)   /* 0x40076000                             */
#define HT_BFTM1_BASE            (HT_APB1PERIPH_BASE + 0x37000)   /* 0x40077000                             */

